{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input_4",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "name": "input_4",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_4"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_97",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_97"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_98",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_97",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_98"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_99",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_98",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_99"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_100",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_99",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_100"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_101",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_100",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_101"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_102",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_101",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_102"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_103",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_102",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_103"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_104",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_103",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_104"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_105",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_104",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_105"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_106",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_105",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_106"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_107",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_106",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_107"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_108",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_107",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_108"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_109",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_108",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_109"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_110",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_109",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_110"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_111",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_110",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_111"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_112",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_111",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_112"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_113",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_112",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_113"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_114",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_113",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_114"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_115",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_114",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_115"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_116",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_115",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_116"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_117",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_116",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_117"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_118",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_117",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_118"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_119",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_118",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_119"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_120",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_119",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_120"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_121",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_120",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_121"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_122",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_121",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_122"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_123",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_122",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_123"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_124",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_123",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_124"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_125",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_124",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_125"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_126",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_125",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_126"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_127",
                    "trainable": true,
                    "units": 5,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_126",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_127"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "softmax",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_128",
                    "trainable": true,
                    "units": 10,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_127",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_128"
            }
        ],
        "name": "model_4",
        "output_layers": [
            [
                "dense_128",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.3.1"
}