{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input_4",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "name": "input_4",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_4"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_10",
                    "trainable": true,
                    "units": 50,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_10"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "sin",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_11",
                    "trainable": true,
                    "units": 10,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_11"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "softmax",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_12",
                    "trainable": true,
                    "units": 10,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_12"
            }
        ],
        "name": "model_4",
        "output_layers": [
            [
                "dense_12",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.3.1"
}